app/Controllers/Admin/Bestellung.php

SELECT *
FROM `bestellungen`
ORDER BY `erstellt_am` DESC
---
    public function index()
    {
        $bestellungModel = new \App\Models\BestellungModel();

        $data = [
            'title' => 'Bestellungen verwalten',
            'bestellungen' => $bestellungModel->orderBy('erstellt_am', 'DESC')->findAll()

DELETE FROM `bestellpositionen`
WHERE `bestellung_id` = '20'
---
    public function loeschen($id)
    {
        $bestellungModel = new \App\Models\BestellungModel();
        $db = \Config\Database::connect();

        $bestellung = $bestellungModel->find($id);

        if (!$bestellung) {
            return redirect()->to('admin/bestellungen')
                ->with('error', 'Bestellung nicht gefunden');
        }

        // Transaktion starten
        $db->transStart();

        // Erst Bestellpositionen löschen
        $db->table('bestellpositionen')
            ->where('bestellung_id', $id)
            ->delete();