app/Controllers/Admin/Dashboard.php

    public function index()
    {
        $bestellungModel = new \App\Models\BestellungModel();
        $produktModel = new \App\Models\ProduktModel();
        $kategorieModel = new \App\Models\KategorieModel();
        $db = \Config\Database::connect();

        // Statistiken für Dashboard
        $data = [
            'title' => 'Dashboard',
            'bestellungen_gesamt' => $bestellungModel->countAll(),
            'bestellungen_neu' => $bestellungModel->where('status', 'neu')->countAllResults(),
            'umsatz_gesamt' => $bestellungModel->selectSum('gesamtpreis')->where('zahlungsstatus', 'bezahlt')->first()['gesamtpreis'] ?? 0,
            'produkte_gesamt' => $produktModel->countAll(),
            'produkte_lagernd' => $produktModel->where('bestand >', 0)->countAllResults(),
            'produkte_ohne_bestand' => $produktModel->where('bestand', 0)->countAllResults(),
            'kategorieModel' => $kategorieModel,

            // Letzte Bestellungen
            'letzte_bestellungen' => $bestellungModel->orderBy('erstellt_am', 'DESC')->limit(5)->find(),

            // Bestseller
            'bestseller' => $db->table('bestellpositionen')
                ->select('produkt_id, produkt_name, SUM(menge) as gesamt_verkauft')
                ->groupBy('produkt_id')
                ->orderBy('gesamt_verkauft', 'DESC')
                ->limit(5)
                ->get()
                ->getResultArray()
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `bestellungen`
WHERE `status` = 'neu'
SELECT *
FROM `bestellungen`
ORDER BY `erstellt_am` DESC
 LIMIT 5
SELECT `produkt_id`, `produkt_name`, SUM(menge) as gesamt_verkauft
FROM `bestellpositionen`
GROUP BY `produkt_id`
ORDER BY `gesamt_verkauft` DESC
 LIMIT 5