app/Controllers/Checkout.php

DELETE FROM `warenkorb_positionen`
WHERE `warenkorb_id` = '1'
---

        // Warenkorb leeren (wird in erstelleBestellung nicht gemacht)
        $db = \Config\Database::connect();
        $db->table('warenkorb_positionen')
            ->where('warenkorb_id', $warenkorb['id'])
            ->delete();