app/Controllers/Warenkorb.php

    public function aktualisieren()
    {
        $request = $this->request;
        $db = \Config\Database::connect();

        $positionen = $request->getPost('positionen');

        if (is_array($positionen)) {
            foreach ($positionen as $id => $menge) {
                if ($menge > 0) {
                    $db->table('warenkorb_positionen')
                        ->where('id', $id)
                        ->update([
                            'menge' => $menge,
                            'aktualisiert_am' => date('Y-m-d H:i:s')
                        ]);
---
UPDATE `warenkorb_positionen` SET `menge` = '10', `aktualisiert_am` = '2025-04-29 15:28:37'
WHERE `id` = 1