app/Models/BestellungModel.php

SELECT *
FROM `bestellpositionen`
WHERE `bestellung_id` = '2'
---
    public function getBestellpositionen($bestellung_id)
    {
        $db = \Config\Database::connect();

        return $db->table('bestellpositionen')
            ->where('bestellung_id', $bestellung_id)
            ->get()
            ->getResultArray();

INSERT INTO `bestellpositionen` (`bestellung_id`, `produkt_id`, `produkt_name`, `menge`, `einzelpreis`, `zwischensumme`) VALUES (2, '5', 'DW 5000 Bass Drum Pedal', '10', '199.99', 1999.9)
UPDATE `produkte` SET `bestand` = bestand - 10
WHERE `id` = '5'
---
    public function erstelleBestellung($data, $warenkorb_positionen)
    {
        $db = \Config\Database::connect();
        $db->transStart();

        // Bestellung einfügen
        $this->insert($data);
        $bestellung_id = $this->insertID();

        // Bestellpositionen einfügen
        foreach ($warenkorb_positionen as $position) {
            $db->table('bestellpositionen')->insert([
                'bestellung_id' => $bestellung_id,
                'produkt_id' => $position['produkt_id'],
                'produkt_name' => $position['produkt_name'],
                'menge' => $position['menge'],
                'einzelpreis' => $position['preis'],
                'zwischensumme' => $position['preis'] * $position['menge']
            ]);

            // Bestand aktualisieren
            $db->table('produkte')
                ->where('id', $position['produkt_id'])
                ->set('bestand', 'bestand - ' . $position['menge'], false)
                ->update();