app/Models/WarenkorbModel.php

    public function getWarenkorbBySession($session_id)
    {
        return $this->where('session_id', $session_id)
            ->first();
---
SELECT *
FROM `warenkorb`
WHERE `session_id` = 'feedb5a0b14b60c9a37a2cc4a8f98367'
 LIMIT 1

    public function getWarenkorbPositionen($warenkorb_id)
    {
        $db = \Config\Database::connect();

        return $db->table('warenkorb_positionen')
            ->where('warenkorb_id', $warenkorb_id)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `warenkorb_positionen`
WHERE `warenkorb_id` = '1'

    public function addWarenkorbPosition($warenkorb_id, $produkt_id, $produkt_name, $menge, $preis)
    {
        $db = \Config\Database::connect();
        $position = $db->table('warenkorb_positionen')
            ->where('warenkorb_id', $warenkorb_id)
            ->where('produkt_id', $produkt_id)
            ->get()
            ->getRowArray();

        if ($position) {
            // Update existing position
            $db->table('warenkorb_positionen')
                ->where('id', $position['id'])
                ->update([
                    'menge' => $position['menge'] + $menge,
                    'aktualisiert_am' => date('Y-m-d H:i:s')
                ]);
        } else {
            // Add new position
            $db->table('warenkorb_positionen')
                ->insert([
                    'warenkorb_id' => $warenkorb_id,
                    'produkt_id' => $produkt_id,
                    'produkt_name' => $produkt_name,
                    'menge' => $menge,
                    'preis' => $preis
                ]);
---
SELECT *
FROM `warenkorb_positionen`
WHERE `warenkorb_id` = '1'
AND `produkt_id` = '4'
INSERT INTO `warenkorb_positionen` (`warenkorb_id`, `produkt_id`, `produkt_name`, `menge`, `preis`) VALUES ('1', '4', 'Meinl HCS Hi-Hat 14\"', '1', '89.99')